app/controllers/customer_controller.rb

SELECT * FROM "listings" WHERE ("listings"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 5)
---
  def view_listing
    @listing = Listing.find(params[:id])
    @user = User.find(session[:user_id]) if session[:user_id]

INSERT INTO "users" ("name", "city", "zip", "updated_at", "message_waiting_timestamp", "text_me_start_time", "call_me_stop_time", "notify_of_failed", "timeout", "message_waiting_id", "street_address", "default_search_single_count", "phone", "response_preference", "time_zone", "default_search_double_count", "password", "call_me_start_time", "email", "state", "text_me_stop_time", "default_search_max_price", "created_at") VALUES('jaideep', 'patiaald', '23244', '2009-02-05 23:53:35', NULL, 8, 17, NULL, NULL, NULL, '#118 prutamasdxc ', 1, '091986745634', NULL, NULL, 1, 'khangura', 9, 'jaideep.ror@gmail.com', 'LA', 21, 500, '2009-02-05 23:53:35')
---
  def activate_registration
    if request.get?
      redirect_to :action => :login
    else
      @customer = User.new params[:customer]
      if @customer.save