app/controllers/data_controller.rb

SELECT * FROM "map_items" WHERE (id in (select distinct map_item_id from discounts))
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "trips" WHERE ("trips".user_id = 1)
---
  def get_map_items
    items = []
    if params[:category]
      session[:map_context] = {:category=>params[:category]}
      items = (params[:category] == "DISCOUNTS") ?
        MapItem.find(:all,:conditions=>"id in (select distinct map_item_id from discounts)") :
        MapItem.find(:all,:conditions=>["category = ?",params[:category]])
    elsif params[:id]
      session[:map_context] = {:map_item_id=>params[:id]}
      items = MapItem.find(:all,:conditions=>"id = #{params[:id]}")
    end

    listings = []
    if session[:user_id]
      @user = User.find(session[:user_id])
      listings = @user.trips.select{|tr| tr.category == "LISTING" and tr.status == "BOOKED"}.map{|tr| tr.listing_unit.listing}

SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "listings" WHERE ("listings"."id" = 1)
SELECT * FROM "trips" WHERE ("trips".user_id = 1)
SELECT * FROM "map_items" WHERE ("map_items"."id" = 1217)
---
  def get_trip_items
    session[:map_context] = {:trip=>true}
    @user = User.find(session[:user_id])
    listings = @user.trips.select{|tr| tr.category == "LISTING"}
    businesses = @user.trips.select{|tr| tr.category == "MAP_ITEM"} #.map{|tr| tr.map_item}