app/controllers/hosted_controller.rb

SELECT * FROM "map_items" WHERE ("map_items"."id" = 1120)
---
  def view_merchant
    @item = MapItem.find(params[:id])