app/controllers/main_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "trips" WHERE ("trips"."id" = 8)
---
  def welcome
    @customer = (session[:user_id]) ? User.find(session[:user_id]) : nil
    @search_context = session[:map_context]
    @see_trip = params[:see_trip] or false
    @see_trip_item = params[:see_trip_item]
    @see_trip_item = (@see_trip_item.nil? or @see_trip_item == "") ? "false" : Trip.find(@see_trip_item).id

INSERT INTO "clicks" ("timestamp", "updated_at", "map_item_id", "target", "created_at") VALUES('2009-02-05 10:38:43', '2009-02-05 10:38:43', 1217, 'pin', '2009-02-05 10:38:43')
---
  def map_item_click
    puts "map item " + params[:type] + " click for item " + params[:id]
    click = Click.new
    click.map_item_id = params[:id]
    click.target = params[:type]
    click.timestamp = Time.now
    click.save!