app/controllers/modal_controller.rb

  def trip_item
    @trip = Trip.find(params[:id])
---
SELECT * FROM "trips" WHERE ("trips"."id" = 6)