app/controllers/owner_controller.rb

  def activate_registration
    if is_post
      @owner = User.new params[:owner]
      if @owner.save
---
INSERT INTO "users" ("name", "city", "zip", "updated_at", "message_waiting_timestamp", "text_me_start_time", "call_me_stop_time", "notify_of_failed", "timeout", "message_waiting_id", "street_address", "default_search_single_count", "phone", "response_preference", "time_zone", "default_search_double_count", "password", "call_me_start_time", "email", "state", "text_me_stop_time", "default_search_max_price", "created_at") VALUES('Ethan Vizitei', 'Columbia', '65201', '2009-02-03 21:38:48', NULL, 1, 20, NULL, NULL, NULL, '123 clark lane', 1, '11234567890', NULL, NULL, 1, 'password', 9, 'e@something.com', 'MO', 24, 500, '2009-02-03 21:38:48')

  def delete_listing
    if confirm_login("delete a listing") and is_post
      confirm_existance_and_ownership_of_listing(params[:id],"delete","listing deleted."){|listing| listing.destroy}
---
DELETE FROM "listings" WHERE "id" = 1

  def save_listing_changes
    if confirm_login("edit listings") and is_post
      redirect_to :action=>:see_listings unless confirm_existance_and_ownership_of_listing(params[:id],"edit","changes to listing saved") do |listing|
        @listing = listing
        @listing.update_attributes(params[:listing])
        params[:attachment_data] ||= []
        params[:attachment_data].each do |file|
          @listing.images.create({:uploaded_data => file, :user => @owner}) unless file == ""
---
UPDATE "listings" SET "street_address" = '4303 S. Providence Road', "description" = 'freakin highschool', "updated_at" = '2009-02-04 14:21:28' WHERE "id" = 1
INSERT INTO "images" ("content_type", "thumbnail", "size", "updated_at", "listing_id", "filename", "height", "user_id", "parent_id", "width", "created_at") VALUES('image/jpeg', NULL, 211207, '2009-02-06 22:57:01', 10, 'Winter_Leaves.jpg', 450, 5, NULL, 600, '2009-02-06 22:57:01')

  def exec_add_listing
    if confirm_login("add a listing") and is_post
      @listing = Listing.new params[:listing]
      @listing.active = true
      @listing.user = @owner
      if @listing.save
        params[:attachment_data] ||= []
        params[:attachment_data].each do |file|
          @listing.images.create({:uploaded_data => file, :user => @owner}) unless file == ""
---
INSERT INTO "listings" ("city", "updated_at", "zip", "extension", "region", "street_address", "description", "strong_name", "user_id", "pricing_type", "lat", "created_at", "state", "active", "long") VALUES('San Francisco', '2009-02-06 00:31:04', '90202', NULL, 'North Shore', '2884 Geary Blvd', 'dssd', 'test listing new', 5, 'FIXED', 37.782328, '2009-02-06 00:31:04', 'CA', 't', -122.449939)
INSERT INTO "images" ("content_type", "thumbnail", "size", "updated_at", "listing_id", "filename", "height", "user_id", "parent_id", "width", "created_at") VALUES('image/jpeg', NULL, 128755, '2009-02-06 01:04:05', 12, 'Forest_Flowers.jpg', 450, NULL, NULL, 600, '2009-02-06 01:04:05')

  def see_listing_calendar
    if confirm_login("see a listings calendar")
      @unit = ListingUnit.find(params[:id])
---
SELECT * FROM "listing_units" WHERE ("listing_units"."id" = 9)

  def add_unit
    listing = Listing.find(params[:id])
---
SELECT * FROM "listings" WHERE ("listings"."id" = 13)

  def exec_add_unit
    @unit = ListingUnit.new(params[:unit])
    if @unit.save
---
INSERT INTO "listing_units" ("updated_at", "price", "listing_id", "description", "strong_name", "created_at", "bed_count", "max_people") VALUES('2009-02-06 22:29:31', 200, 13, 'okokok', 'twestft', '2009-02-06 22:29:31', 1, 3)

  def delete_listing_image
    if confirm_login("delete this image")
      img = @owner.images.find_by_id(params[:id])
      img.destroy if img
---
SELECT * FROM "images" WHERE ("images"."id" = '23') AND ("images".user_id = 5) LIMIT 1
DELETE FROM "images" WHERE "id" = 24