app/controllers/trip_controller.rb

  def add_map_item
    trip = @user.add_map_item_to_trip(MapItem.find(params[:id]))
---
SELECT * FROM "map_items" WHERE ("map_items"."id" = 1217)

  def add_listing
    trip = @user.add_listing_to_trip(ListingUnit.find(params[:id]),
                                     DateTime.parse("#{params[:start_date]} #{params[:start_time][:hour]}:#{params[:start_time][:minute]}"),
                                     DateTime.parse("#{params[:stop_date]} #{params[:stop_time][:hour]}:#{params[:stop_time][:minute]}"))
---
SELECT * FROM "listing_units" WHERE ("listing_units"."id" = 1)
SELECT * FROM "listings" WHERE ("listings"."id" = 1)